app/views/coordinates/show.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."coordinate_id" = ?  [["coordinate_id", 1]]
---
    <% end %>
    <p><%= @coordinate.likes.count %>人が「いいね!」しました。</p>