app/views/users/show.html.erb

<p>いいねした投稿</p>
<% @user.liked_coordinates.each do |coordinate| %>
---
SELECT "coordinates".* FROM "coordinates" WHERE "coordinates"."user_id" = ?  [["user_id", 2]]