app/views/users/top.html.erb

SELECT "coordinates".* FROM "coordinates" WHERE "coordinates"."user_id" = ? ORDER BY "coordinates"."created_at" DESC  [["user_id", 1]]
---
            <!-- いいね機能 -->
            <% @user.liked_coordinates.each do |coordinate| %>