app/controllers/coordinates_controller.rb

SELECT "coordinates".* FROM "coordinates" ORDER BY "coordinates"."created_at" DESC
---
  def index
  	@coordinates = Coordinate.page(params[:page]).per(PER)

INSERT INTO "coordinates" ("created_at", "updated_at", "user_id", "body", "coordinate_image_id") VALUES (?, ?, ?, ?, ?)
---
  def create
  	@coordinate = Coordinate.new(coordinate_params)
    @coordinate.user = current_user
  	if @coordinate.save

SELECT  "coordinates".* FROM "coordinates" WHERE "coordinates"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."coordinate_id" = ?  [["coordinate_id", 21]]
---
  def show
  	@coordinate = Coordinate.find(params[:id])
    @items = Item.where(coordinate_id: @coordinate.id)

SELECT  "coordinates".* FROM "coordinates" WHERE "coordinates"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
  	@coordinate = Coordinate.find(params[:id])

SELECT  "coordinates".* FROM "coordinates" WHERE "coordinates"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "coordinates" SET "coordinate_image_id" = ?, "body" = ?, "updated_at" = ? WHERE "coordinates"."id" = ?  [["coordinate_image_id", "c3539824daedb14825e307ff3a00c106870d5391fe7431d5dcb2f23d3668"], ["body", "編集"], ["updated_at", "2019-07-09 11:05:53.775869"], ["id", 2]]
---
  def update
  	@coordinate = Coordinate.find(params[:id])
  	@coordinate.user_id = current_user.id
  	if @coordinate.update(update_coordinate_params)

SELECT  "coordinates".* FROM "coordinates" WHERE "coordinates"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "coordinates" WHERE "coordinates"."id" = ?  [["id", 6]]
---
  def destroy
  	@coordinate = Coordinate.find(params[:id])
  	@coordinate.destroy

SELECT "coordinates".* FROM "coordinates" WHERE "coordinates"."user_id" IN (SELECT "users"."id" FROM "users" WHERE "users"."sex" = ?)  [["sex", "男性"]]
---
  def mens_coordinate
    @users = User.where(sex: "男性")
    @coordinates = Coordinate.where(user_id: @users).page(params[:page]).per(PER)

SELECT "coordinates".* FROM "coordinates" WHERE (body LIKE '%あああ%')
---
  def search
    @coordinates = Coordinate.search(params[:search]).page(params[:page]).per(PER)