app/controllers/likes_controller.rb

INSERT INTO "likes" ("coordinate_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["coordinate_id", 1], ["user_id", 1], ["created_at", "2019-07-22 06:43:39.071829"], ["updated_at", "2019-07-22 06:43:39.071829"]]
---
	def create
		@like = current_user.likes.create(coordinate_id: params[:coordinate_id])

SELECT  "likes".* FROM "likes" WHERE "likes"."coordinate_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["coordinate_id", 1], ["user_id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
---
	def destroy
		@like = Like.find_by(coordinate_id: params[:coordinate_id], user_id: current_user.id)
		@like.destroy