app/controllers/messages_controller.rb

INSERT INTO "messages" ("user_id", "room_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["room_id", 1], ["content", "こんにちは！"], ["created_at", "2019-07-19 05:46:21.577687"], ["updated_at", "2019-07-19 05:46:21.577687"]]
---
	def create
		if Entry.where(:user_id => current_user.id, :room_id => params[:message][:room_id])
			@message = Message.create(params.require(:message).permit(:user_id, :content, :room_id).merge(:user_id => current_user.id))