app/controllers/users_controller.rb

  def show
  	@user = User.find(params[:id])
  	@coordinates = Coordinate.where(user_id: @user)

    #チャット機能
    @currentUserEntry = Entry.where(user_id: current_user.id)
    @userEntry = Entry.where(user_id: @user.id)
    if @user.id == current_user.id
    else
      @currentUserEntry.each do |cu|
        @userEntry.each do |u|
---
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 1]]
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 3]]