app/controllers/users_controller.rb

  def top
  	@user = current_user
    @coordinates = Coordinate.where(user_id: @user)
---
SELECT "coordinates".* FROM "coordinates" WHERE "coordinates"."user_id" = ? ORDER BY "coordinates"."created_at" DESC  [["user_id", 1]]

  def show
  	@user = User.find(params[:id])
  	@coordinates = Coordinate.where(user_id: @user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "coordinates".* FROM "coordinates" WHERE "coordinates"."user_id" = ?  [["user_id", 1]]

  def update
  	@user = User.find(params[:id])
  	if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "kanji_name" = ?, "kana_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "2d3cc14f65f7a5572b42f4852e939d3d3bf63b5b6b43ec0d75c0b1243ebc"], ["kanji_name", "1111111111"], ["kana_name", "山田"], ["updated_at", "2019-07-09 11:33:00.008496"], ["id", 1]]