app/models/user.rb

SELECT  1 AS one FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."coordinate_id" = ? LIMIT ?  [["user_id", 1], ["coordinate_id", 1], ["LIMIT", 1]]
---
  def already_liked?(coordinate)
    self.likes.exists?(coordinate_id: coordinate.id)